Revit 2024 API
PostEventArgs.Status Property
 Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an APIevent handler).
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public EventStatus Status { get; }
Visual Basic
Public ReadOnly Property Status As EventStatus
	Get
Visual C++
public:
property EventStatus Status {
	EventStatus get ();
}
See Also
PostEventArgs Class
Autodesk.Revit.DB.Events Namespace